2025.10.21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-21 Tue 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.10.14.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.10.28.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 14 to 21, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Backstage OCaml: ocaml.nvim - A Neovim Plugin for OCaml</a></li>
<li><a href="#2">Ocaml notebooks in web browser</a></li>
<li><a href="#3">Cure2 - combinator frontend for re2</a></li>
<li><a href="#4">Other OCaml News</a></li>
<li><a href="#orgba8a8ce">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Backstage OCaml: ocaml.nvim - A Neovim Plugin for OCaml</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-backstage-ocaml-ocaml-nvim-a-neovim-plugin-for-ocaml/17383/1">https://discuss.ocaml.org/t/ann-backstage-ocaml-ocaml-nvim-a-neovim-plugin-for-ocaml/17383/1</a>
</p>
</div>
<div id="outline-container-orgb5519fe" class="outline-3">
<h3 id="orgb5519fe">Charlène_Gros announced</h3>
<div class="outline-text-3" id="text-orgb5519fe">
<p>
We’re excited to announce <b><b>ocaml.nvim</b></b>, a new Neovim plugin actively being developed by Tarides that brings advanced OCaml development features to Neovim users. Think of it as the Neovim sibling of <a href="https://github.com/tarides/ocaml-eglot">ocaml-eglot</a>, which we released earlier this year for Emacs users.
</p>
</div>
<div id="outline-container-org372c9cd" class="outline-4">
<h4 id="org372c9cd">What is ocaml.nvim?</h4>
<div class="outline-text-4" id="text-org372c9cd">
<p>
Modern code editors communicate with programming languages through the Language Server Protocol (LSP), which provides essential features like syntax checking, code navigation, and auto-completion. However, OCaml’s language server exposes powerful custom commands beyond what generic LSP clients can access.
</p>

<p>
ocaml.nvim works alongside generic Neovim LSP plugins like <code>nvim-lspconfig</code>, providing direct access to advanced ocamllsp features without requiring complex editor-side logic. The plugin gives you access to all the advanced Merlin commands not supported by generic LSP clients.
</p>
</div>
</div>
<div id="outline-container-org51af6da" class="outline-4">
<h4 id="org51af6da">Key Features</h4>
<div class="outline-text-4" id="text-org51af6da">
<p>
<b>Typed Holes Navigation</b> - Navigate between typed holes (<code>_</code>) and interactively substitute them with the Construct command.
</p>

<p>
<b>Semantic Navigation</b> - Move through your code semantically: jump between expressions, parent <code>let</code> bindings, modules, functions, and <code>match</code> expressions.
</p>

<p>
<b>Phrase Navigation</b> - Move between OCaml phrases (top-level definitions) in your buffer.
</p>

<p>
Many more features are in development, including alternating between <code>.ml</code> and <code>.mli</code> files, type enclosing, and pattern matching generation.
</p>
</div>
</div>
<div id="outline-container-orgf471a4b" class="outline-4">
<h4 id="orgf471a4b">Getting Started</h4>
<div class="outline-text-4" id="text-orgf471a4b">
<p>
Installation is straightforward with lazy.nvim:
</p>

<div class="org-src-container">
<pre class="src src-lua"><code>require("lazy").setup({
  { "tarides/ocaml.nvim",
    config = function()
      require("ocaml").setup()
    end
  }
})
</code></pre>
</div>

<p>
The plugin complements your existing LSP setup—you’ll continue to use Neovim’s built-in LSP for standard features while ocaml.nvim adds OCaml-specific capabilities.
</p>
</div>
</div>
<div id="outline-container-org059a8ba" class="outline-4">
<h4 id="org059a8ba">Project Status</h4>
<div class="outline-text-4" id="text-org059a8ba">
<p>
The ocaml.nvim repository is now public on <a href="https://github.com/tarides/ocaml.nvim">GitHub</a>, with comprehensive documentation, a feature table, and screencast demonstrations. We’re working towards a stable 1.0 release and welcome feedback from the community.
</p>

<p>
Try out <code>ocaml.nvim</code> and let us know what you think! For questions or feedback, you can post an issue on the ocaml.nvim GitHub repository.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Ocaml notebooks in web browser</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-notebooks-in-web-browser/17385/1">https://discuss.ocaml.org/t/ocaml-notebooks-in-web-browser/17385/1</a>
</p>
</div>
<div id="outline-container-org20a1471" class="outline-3">
<h3 id="org20a1471">Davy announced</h3>
<div class="outline-text-3" id="text-org20a1471">
<p>
Hello everyone !
</p>

<p>
I’m currently learning Ocaml, and found no better way to learn than working on a project :
</p>

<p>
I’m happy to announce <b>xeus-ocaml</b>, a new kernel to run Ocaml from <b>Jupyterlite</b> notebooks :partying_face:
</p>

<p>
I’m far from a professional developer, and very new to Ocaml, so do not hesitate to <a href="https://davy39.github.io/xeus-ocaml/lab/index.html?path=demo.ipynb">try it</a> with your workflow, report any <a href="https://github.com/davy39/xeus-ocaml/issues/new">new issues</a>, ask for other external libraries (currently only stdlib and ocamlgraph), or contribute to its development to make the code more robust and idiomatic.
</p>

<p>
Any feedback would be appreciated!
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Cure2 - combinator frontend for re2</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-cure2-combinator-frontend-for-re2/17410/1">https://discuss.ocaml.org/t/ann-cure2-combinator-frontend-for-re2/17410/1</a>
</p>
</div>
<div id="outline-container-org0e0f769" class="outline-3">
<h3 id="org0e0f769">Emile Trotignon announced</h3>
<div class="outline-text-3" id="text-org0e0f769">
<p>
<a href="https://github.com/ahrefs/cure2">Cure2</a> is a little library I just made, that provide a combinator frontend to Re2.
</p>

<p>
With it, instead of <code>"https?:\\/\\/(?:www\\.)?[-a-zA-Z0-9@:%._\\+~#=]{1,256}\\.[a-zA-Z0-9()]{1,6}\\b(?:[-a-zA-Z0-9()@:%_\\+.~#?&amp;//=]*)"</code>,
you can write:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">second_level_char</span> = charset <span style="color: #557400;">Charset.</span>[<span style="color: #557400;">Ascii.</span>alnum; chars <span style="color: #ca3400;">"-@:%._\\+~#="</span>] <span style="color: #242521; font-weight: bold;">in</span>
<span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">top_level_chars</span> = charset <span style="color: #557400;">Charset.</span>[<span style="color: #557400;">Ascii.</span>alnum; chars <span style="color: #ca3400;">"()"</span>] <span style="color: #242521; font-weight: bold;">in</span>
<span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">path_chars</span> = charset <span style="color: #557400;">Charset.</span>[<span style="color: #557400;">Ascii.</span>alnum; chars <span style="color: #ca3400;">"()@:%_\\+.~#?&amp;/="</span>] <span style="color: #242521; font-weight: bold;">in</span>
str <span style="color: #ca3400;">"http"</span> + <span style="color: #9f0d0f;">!?</span>(char <span style="color: #ca3400;">'s'</span>) + str <span style="color: #ca3400;">"://"</span>
+ <span style="color: #9f0d0f;">!?</span>(str <span style="color: #ca3400;">"www."</span>) + rep <span style="color: #444fcf;">~min</span>:1 <span style="color: #444fcf;">~max</span>:256 second_level_char
+ char <span style="color: #ca3400;">'.'</span> + rep <span style="color: #444fcf;">~min</span>:1 <span style="color: #444fcf;">~max</span>:6 top_level_chars
+ bow + rep path_chars
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Other OCaml News</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4ee7e49" class="outline-3">
<h3 id="org4ee7e49">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org4ee7e49">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://fearful-odds.rocks/blog/setting-up-otel-with-ocaml">Setting up Open Telemetry (OTel, Prometheus, Grafana and Jaeger) with OCaml</a></li>
<li><a href="https://www.tunbury.org/2025/10/18/ci-support-for-ocaml-54/">CI support for OCaml 5.4</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgba8a8ce" class="outline-2">
<h2 id="orgba8a8ce">Old CWN</h2>
<div class="outline-text-2" id="text-orgba8a8ce">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org7b07647">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
